import os

from django.conf import settings
from django.core.management.base import BaseCommand
from django.core.files import File
from core.models import Dish, Ingredient, DishIngredient, IncompatibleIngredient


class Command(BaseCommand):

    def handle(self, *args, **kwargs):

        ingredients_db = [
            {'name': 'Яйце куряче', 'cal': 155, 'prot': 13, 'fat': 11, 'carb': 1.1},
            {'name': 'Яєчний білок', 'cal': 52, 'prot': 11, 'fat': 0.2, 'carb': 0.7},
            {'name': 'Куряче філе', 'cal': 110, 'prot': 23, 'fat': 1.2, 'carb': 0},
            {'name': 'Індичка (філе)', 'cal': 115, 'prot': 24, 'fat': 1.5, 'carb': 0},
            {'name': 'Яловичина (пісна)', 'cal': 250, 'prot': 26, 'fat': 15, 'carb': 0},
            {'name': 'Лосось (свіжий)', 'cal': 208, 'prot': 20, 'fat': 13, 'carb': 0},
            {'name': 'Тріска (риба)', 'cal': 82, 'prot': 18, 'fat': 0.7, 'carb': 0},
            {'name': 'Креветки', 'cal': 99, 'prot': 24, 'fat': 0.3, 'carb': 0.2},
            {'name': 'Сир кисломолочний 5%', 'cal': 121, 'prot': 17, 'fat': 5, 'carb': 1.8},
            {'name': 'Сметана 15%', 'cal': 160, 'prot': 2.6, 'fat': 15, 'carb': 3.6},
            {'name': 'Грецький йогурт', 'cal': 59, 'prot': 10, 'fat': 0.4, 'carb': 3.6},
            {'name': 'Тофу', 'cal': 76, 'prot': 8, 'fat': 4.8, 'carb': 1.9},
            {'name': 'Протеїн (порошок)', 'cal': 370, 'prot': 78, 'fat': 4, 'carb': 6},

            {'name': 'Вівсянка (пластівці)', 'cal': 360, 'prot': 12, 'fat': 6, 'carb': 60},
            {'name': 'Рис білий (сухий)', 'cal': 360, 'prot': 7, 'fat': 0.6, 'carb': 78},
            {'name': 'Гречка (суха)', 'cal': 330, 'prot': 12.6, 'fat': 3.3, 'carb': 62},
            {'name': 'Кіноа (суха)', 'cal': 368, 'prot': 14, 'fat': 6, 'carb': 64},
            {'name': 'Сочевиця (суха)', 'cal': 350, 'prot': 24, 'fat': 1.1, 'carb': 60},
            {'name': 'Нут (варений)', 'cal': 164, 'prot': 9, 'fat': 2.6, 'carb': 27},
            {'name': 'Батат', 'cal': 86, 'prot': 1.6, 'fat': 0.1, 'carb': 20},
            {'name': 'Хліб цільнозерновий', 'cal': 250, 'prot': 10, 'fat': 4, 'carb': 45},
            {'name': 'Лаваш тонкий', 'cal': 230, 'prot': 8, 'fat': 1, 'carb': 48},
            {'name': 'Борошно', 'cal': 364, 'prot': 10, 'fat': 1, 'carb': 76},

            {'name': 'Шпинат', 'cal': 23, 'prot': 2.9, 'fat': 0.4, 'carb': 3.6},
            {'name': 'Броколі', 'cal': 34, 'prot': 2.8, 'fat': 0.4, 'carb': 6.6},
            {'name': 'Томати', 'cal': 18, 'prot': 0.9, 'fat': 0.2, 'carb': 3.9},
            {'name': 'Огірок', 'cal': 15, 'prot': 0.7, 'fat': 0.1, 'carb': 3.6},
            {'name': 'Болгарський перець', 'cal': 27, 'prot': 1, 'fat': 0.2, 'carb': 5.3},
            {'name': 'Авокадо', 'cal': 160, 'prot': 2, 'fat': 15, 'carb': 9},
            {'name': 'Кабачок', 'cal': 17, 'prot': 1.2, 'fat': 0.3, 'carb': 3.1},
            {'name': 'Морква', 'cal': 41, 'prot': 0.9, 'fat': 0.2, 'carb': 9.6},
            {'name': 'Печериці', 'cal': 22, 'prot': 3.1, 'fat': 0.3, 'carb': 3.3},
            {'name': 'Спаржа', 'cal': 20, 'prot': 2.2, 'fat': 0.1, 'carb': 3.9},
            {'name': 'Баклажан', 'cal': 25, 'prot': 1, 'fat': 0.2, 'carb': 6},
            {'name': 'Цибуля', 'cal': 40, 'prot': 1.1, 'fat': 0.1, 'carb': 9},

            {'name': 'Банан', 'cal': 89, 'prot': 1.1, 'fat': 0.3, 'carb': 23},
            {'name': 'Яблуко', 'cal': 52, 'prot': 0.3, 'fat': 0.2, 'carb': 14},
            {'name': 'Ягоди (мікс)', 'cal': 50, 'prot': 1, 'fat': 0.5, 'carb': 12},

            {'name': 'Оливкова олія', 'cal': 884, 'prot': 0, 'fat': 100, 'carb': 0},
            {'name': 'Мигдаль', 'cal': 579, 'prot': 21, 'fat': 50, 'carb': 22},
            {'name': 'Насіння Чіа', 'cal': 486, 'prot': 17, 'fat': 31, 'carb': 42},
            {'name': 'Мед', 'cal': 304, 'prot': 0.3, 'fat': 0, 'carb': 82},
            {'name': 'Соєвий соус', 'cal': 53, 'prot': 8, 'fat': 0.6, 'carb': 4.9},
            {'name': 'Пармезан', 'cal': 431, 'prot': 38, 'fat': 29, 'carb': 4},
            {'name': 'Хумус', 'cal': 166, 'prot': 8, 'fat': 10, 'carb': 14},
            {'name': 'Песто соус', 'cal': 500, 'prot': 5, 'fat': 50, 'carb': 5},
            {'name': 'Молоко 2.5%', 'cal': 52, 'prot': 2.8, 'fat': 2.5, 'carb': 4.7},
            {'name': 'Молоко мигдальне', 'cal': 15, 'prot': 0.5, 'fat': 1.2, 'carb': 0},
            {'name': 'Вода питна', 'cal': 0, 'prot': 0, 'fat': 0, 'carb': 0},

            {'name': 'Сир Фета', 'cal': 264, 'prot': 14, 'fat': 21, 'carb': 4},
            {'name': 'Моцарела', 'cal': 280, 'prot': 28, 'fat': 17, 'carb': 3},
            {'name': 'Тунець (консервований)', 'cal': 116, 'prot': 26, 'fat': 1, 'carb': 0},
            {'name': 'Паста (тверді сорти)', 'cal': 350, 'prot': 12, 'fat': 1.5, 'carb': 71},
            {'name': 'Картопля', 'cal': 77, 'prot': 2, 'fat': 0.4, 'carb': 17},
            {'name': 'Капуста білокачанна', 'cal': 25, 'prot': 1.3, 'fat': 0.1, 'carb': 5.8},
            {'name': 'Часник', 'cal': 149, 'prot': 6.4, 'fat': 0.5, 'carb': 33},
            {'name': 'Томатна паста', 'cal': 82, 'prot': 4.3, 'fat': 0.4, 'carb': 19},
            {'name': 'Арахісова паста', 'cal': 588, 'prot': 25, 'fat': 50, 'carb': 20},
            {'name': 'Волоські горіхи', 'cal': 654, 'prot': 15, 'fat': 65, 'carb': 14},
            {'name': 'Какао-порошок', 'cal': 289, 'prot': 24, 'fat': 15, 'carb': 10},
            {'name': 'Буряк', 'cal': 43, 'prot': 1.6, 'fat': 0.2, 'carb': 9.6},
            {'name': 'Гарбуз', 'cal': 26, 'prot': 1, 'fat': 0.1, 'carb': 6.5},
            {'name': 'Куряча печінка', 'cal': 137, 'prot': 24, 'fat': 4, 'carb': 0.6},
            {'name': 'Кальмар', 'cal': 92, 'prot': 18, 'fat': 2, 'carb': 2},
            {'name': 'Тунець (свіжий)', 'cal': 130, 'prot': 29, 'fat': 1, 'carb': 0},
            {'name': 'Цвітна капуста', 'cal': 25, 'prot': 1.9, 'fat': 0.3, 'carb': 5},
            {'name': 'Мідії', 'cal': 86, 'prot': 12, 'fat': 2, 'carb': 3},
        ]

        ing_objects = {}
        for item in ingredients_db:
            obj, _ = Ingredient.objects.update_or_create(
                name=item['name'],
                defaults={
                    'calories_per_100g': item['cal'], 'protein_per_100g': item['prot'],
                    'fat_per_100g': item['fat'], 'carbs_per_100g': item['carb'],
                }
            )
            ing_objects[item['name']] = obj

        dishes_data = [
            # --- СНІДАНКИ ---
            {'id': 1, 'image': 'omelette.jpg', 'title': 'Омлет з овочами', 'price': '65.00', 'meal_type': 'breakfast',
             'description': 'Омлет із яйцем, болгарським перцем та шпинатом.'},
            {'id': 2, 'image': 'oatmeal-with-banana.jpg', 'title': 'Вівсянка з бананом і горіхами', 'price': '55.00',
             'meal_type': 'breakfast', 'description': 'Вівсянка з бананом, мигдалем і невеликою кількістю меду.'},
            {'id': 3, 'image': 'scrambled-eggs.jpg', 'title': 'Яєчня з авокадо', 'price': '60.00',
             'meal_type': 'breakfast', 'description': 'Яєчня зі стиглим авокадо та зеленню.'},
            {'id': 4, 'image': 'greek-yogurt-with-mixed-berries.jpg', 'title': 'Грецький йогурт із ягодами',
             'price': '48.00', 'meal_type': 'breakfast', 'description': 'Грецький йогурт із міксом свіжих ягід.'},
            {'id': 5, 'image': 'cottage-cheese-pancakes.jpg', 'title': 'Сирники', 'price': '70.00',
             'meal_type': 'breakfast', 'description': 'Домашні сирники зі сметаною.'},
            {'id': 6, 'image': 'smoothie.jpg', 'title': 'Протеїновий смузі', 'price': '45.00', 'meal_type': 'breakfast',
             'description': 'Смузі з протеїном, бананом і ягодами.'},
            {'id': 7, 'image': 'avocado-toast.jpg', 'title': 'Цільнозерновий тост із авокадо', 'price': '52.00',
             'meal_type': 'breakfast', 'description': 'Цільнозерновий тост із пюре з авокадо.'},
            {'id': 8, 'image': 'chia-pudding.jpg', 'title': 'Пудинг із чіа на мигдальному молоці', 'price': '58.00',
             'meal_type': 'breakfast', 'description': 'Пудинг із насіння чіа на мигдальному молоці з фруктами.'},
            {'id': 9, 'image': 'boiled-eggs.jpg', 'title': 'Варені яйця зі шпинатом', 'price': '40.00',
             'meal_type': 'breakfast', 'description': 'Варені яйця зі шпинатом і оливковою олією.'},
            {'id': 10, 'image': 'almond-banana-pancake.jpg', 'title': 'Бананові панкейки', 'price': '62.00',
             'meal_type': 'breakfast', 'description': 'Бананові панкейки без цукру з медом.'},
            {'id': 11, 'image': 'cottage-cheese-casserole.jpg', 'title': 'Сирна запіканка', 'price': '75.00',
             'meal_type': 'breakfast', 'description': 'Ніжна сирна запіканка з медом.'},
            {'id': 12, 'image': 'peanut-butter-toast.jpg', 'title': 'Тост із арахісовою пастою', 'price': '55.00',
             'meal_type': 'breakfast', 'description': 'Тост із арахісовою пастою та скибочками банана.'},
            {'id': 13, 'image': 'feta-tomato-omelette.jpg', 'title': 'Омлет з томатами та фетою', 'price': '68.00',
             'meal_type': 'breakfast', 'description': 'Омлет із сиром Фета та свіжими томатами.'},
            {'id': 14, 'image': 'oat-pancake.jpg', 'title': 'Вівсяноблін з куркою', 'price': '72.00',
             'meal_type': 'breakfast', 'description': 'Ситний вівсяноблін з курячим філе та сиром.'},
            {'id': 15, 'image': 'chocolate-oatmeal.jpg', 'title': 'Шоколадна вівсянка', 'price': '50.00',
             'meal_type': 'breakfast', 'description': 'Вівсянка з какао, молоком та горіхами.'},
            {'id': 16, 'image': 'quinoa-smoothie-bowl.jpg', 'title': 'Смузі-боул з кіноа', 'price': '85.00',
             'meal_type': 'breakfast', 'description': 'Смузі-боул на основі мигдального молока з кіноа та ягодами.'},
            {'id': 17, 'image': 'poached-eggs-spinach.jpg', 'title': 'Яйця пашот на шпинатній подушці',
             'price': '64.00', 'meal_type': 'breakfast', 'description': 'Яйця пашот зі свіжим шпинатом та тостом.'},
            {'id': 18, 'image': 'lazy-dumplings.jpg', 'title': 'Ліниві вареники', 'price': '60.00',
             'meal_type': 'breakfast', 'description': 'Традиційні ліниві вареники з сиру.'},
            {'id': 19, 'image': 'tuna-cucumber-toast.jpg', 'title': 'Тост з тунцем та огірком', 'price': '66.00',
             'meal_type': 'breakfast', 'description': 'Ситний тост із консервованим тунцем та свіжим огірком.'},
            {'id': 20, 'image': 'broccoli-frittata.jpg', 'title': 'Фріттата з броколі', 'price': '70.00',
             'meal_type': 'breakfast', 'description': 'Італійська фріттата з броколі та молоком.'},
            {'id': 21, 'image': 'buckwheat-milk.jpg', 'title': 'Гречана каша з молоком', 'price': '35.00',
             'meal_type': 'breakfast', 'description': 'Класична гречана каша з молоком та медом.'},
            {'id': 22, 'image': 'baked-apples-cottage-cheese.jpg', 'title': 'Запечені яблука з сиром', 'price': '55.00',
             'meal_type': 'breakfast', 'description': 'Запечені яблука, фаршировані сиром та горіхами.'},
            {'id': 23, 'image': 'whole-wheat-pancakes.jpg', 'title': 'Млинці з цільнозернового борошна',
             'price': '45.00', 'meal_type': 'breakfast',
             'description': 'Тонкі млинці на молоці з цільнозернового борошна.'},
            {'id': 24, 'image': 'yogurt-walnuts-honey.jpg', 'title': 'Йогурт з горіхами та медом', 'price': '50.00',
             'meal_type': 'breakfast', 'description': 'Густий грецький йогурт із волоськими горіхами.'},
            {'id': 25, 'image': 'caprese-toast.jpg', 'title': 'Тост Капрезе', 'price': '75.00',
             'meal_type': 'breakfast', 'description': 'Тост із моцарелою, томатами та соусом песто.'},

            # --- ОБІДИ ---
            {'id': 26, 'image': 'chicken-rice.jpg', 'title': 'Курка-гриль із рисом і броколі', 'price': '85.00',
             'meal_type': 'lunch', 'description': 'Куряча грудинка на грилі з відвареним рисом і броколі.'},
            {'id': 27, 'image': 'beef-stir.jpg', 'title': 'Яловичина з овочами на сковороді', 'price': '95.00',
             'meal_type': 'lunch', 'description': 'Обсмажена яловичина з овочами в соєвому соусі.'},
            {'id': 28, 'image': 'lentil-soup.jpg', 'title': 'Суп із сочевиці', 'price': '58.00', 'meal_type': 'lunch',
             'description': 'Суп із сочевиці, моркви, селери та спецій.'},
            {'id': 29, 'image': 'tabbouleh-salad.jpg', 'title': 'Салат із кіноа та нутом', 'price': '70.00',
             'meal_type': 'lunch', 'description': 'Салат із кіноа, нутом, огірком і лимонною заправкою.'},
            {'id': 30, 'image': 'baked-salmon.jpg', 'title': 'Запечений лосось із овочами', 'price': '110.00',
             'meal_type': 'lunch', 'description': 'Запечений лосось із овочами (кабачки, морква, перець).'},
            {'id': 31, 'image': 'turkey-meatballs.jpg', 'title': 'Фрикадельки з індички', 'price': '88.00',
             'meal_type': 'lunch', 'description': 'Фрикадельки з індички в домашньому томатному соусі.'},
            {'id': 32, 'image': 'veggie-wrap.jpg', 'title': 'Овочевий врап із хумусом', 'price': '60.00',
             'meal_type': 'lunch', 'description': 'Овочевий лаваш із хумусом та зеленню.'},
            {'id': 33, 'image': 'shrimp-with-zucchini-noodles.jpg', 'title': 'Креветки з кабачковою локшиною',
             'price': '105.00', 'meal_type': 'lunch', 'description': 'Креветки на грилі з кабачковою “локшиною”.'},
            {'id': 34, 'image': 'caesar-salad.jpg', 'title': 'Салат Цезар із куркою', 'price': '75.00',
             'meal_type': 'lunch', 'description': 'Класичний салат Цезар із куркою, сухариками й пармезаном.'},
            {'id': 35, 'image': 'cooked-bell-peppers.jpg', 'title': 'Фарширований перець', 'price': '82.00',
             'meal_type': 'lunch', 'description': 'Перець, фарширований м’ясом, рисом і томатами.'},
            {'id': 36, 'image': 'tuna-tomato-pasta.jpg', 'title': 'Паста з тунцем у томатному соусі', 'price': '80.00',
             'meal_type': 'lunch', 'description': 'Паста твердих сортів із тунцем та томатами.'},
            {'id': 37, 'image': 'ukrainian-borsch.jpg', 'title': 'Борщ із куркою', 'price': '65.00',
             'meal_type': 'lunch', 'description': 'Класичний український борщ на курячому бульйоні.'},
            {'id': 38, 'image': 'chicken-pilaf.jpg', 'title': 'Плов з куркою', 'price': '85.00', 'meal_type': 'lunch',
             'description': 'Традиційний плов з курячим філе та морквою.'},
            {'id': 39, 'image': 'buckwheat-beef-mushrooms.jpg', 'title': 'Гречка з яловичиною та грибами',
             'price': '95.00', 'meal_type': 'lunch',
             'description': 'Ситна гречка зі шматочками яловичини та печерицями.'},
            {'id': 40, 'image': 'nicoise-salad.jpg', 'title': 'Салат Нісуаз', 'price': '90.00', 'meal_type': 'lunch',
             'description': 'Французький салат із тунцем, яйцем та свіжими овочами.'},
            {'id': 41, 'image': 'baked-potatoes-fish.jpg', 'title': 'Картопля запечена з рибою', 'price': '105.00',
             'meal_type': 'lunch', 'description': 'Тріска, запечена з картоплею у сметанному соусі.'},
            {'id': 42, 'image': 'steamed-chicken-cutlets.jpg', 'title': 'Курячі котлети на пару з кіноа',
             'price': '85.00', 'meal_type': 'lunch', 'description': 'Дієтичні парові котлети з гарніром із кіноа.'},
            {'id': 43, 'image': 'turkey-bolognese.jpg', 'title': 'Паста Болоньєзе з індички', 'price': '92.00',
             'meal_type': 'lunch', 'description': 'Болоньєзе з фаршу індички у томатному соусі.'},
            {'id': 44, 'image': 'stewed-cabbage-beef.jpg', 'title': 'Тушкована капуста з яловичиною', 'price': '80.00',
             'meal_type': 'lunch', 'description': 'Білокачанна капуста, тушкована зі шматочками яловичини.'},
            {'id': 45, 'image': 'asian-shrimp-rice.jpg', 'title': 'Рис з креветками по-азійськи', 'price': '120.00',
             'meal_type': 'lunch', 'description': 'Рис, обсмажений з креветками у соєвому соусі.'},
            {'id': 46, 'image': 'pumpkin-soup.jpg', 'title': 'Суп-пюре з гарбуза', 'price': '60.00',
             'meal_type': 'lunch', 'description': 'Кремовий гарбузовий суп із молоком та насінням.'},
            {'id': 47, 'image': 'warm-beef-salad.jpg', 'title': 'Теплий салат з телятиною', 'price': '115.00',
             'meal_type': 'lunch', 'description': 'Салат зі свіжих овочів та обсмаженої телятини.'},
            {'id': 48, 'image': 'navy-style-pasta.jpg', 'title': 'Макарони по-флотськи з куркою', 'price': '75.00',
             'meal_type': 'lunch', 'description': 'Макарони твердих сортів з обсмаженим курячим філе.'},
            {'id': 49, 'image': 'lentil-cream-soup.jpg', 'title': 'Сочевичний крем-суп', 'price': '55.00',
             'meal_type': 'lunch', 'description': 'Густий крем-суп із сочевиці та моркви.'},
            {'id': 50, 'image': 'chicken-liver-apples.jpg', 'title': 'Куряча печінка з яблуками', 'price': '70.00',
             'meal_type': 'lunch', 'description': 'Куряча печінка, тушкована з яблуками та цибулею.'},

            # --- ВЕЧЕРІ ---
            {'id': 51, 'image': 'tofu-stir-fry.jpg', 'title': 'Тофу з овочами', 'price': '78.00', 'meal_type': 'dinner',
             'description': 'Смажене тофу з овочами у соєвому соусі.'},
            {'id': 52, 'image': 'grilled-turkey.jpg', 'title': 'Індичка-гриль із бататом', 'price': '90.00',
             'meal_type': 'dinner', 'description': 'Індичка на грилі з печеним бататом.'},
            {'id': 53, 'image': 'zucchini-noodles.jpg', 'title': 'Кабачкова локшина з песто', 'price': '68.00',
             'meal_type': 'dinner', 'description': 'Кабачкові “локшини” з соусом песто та сиром.'},
            {'id': 54, 'image': 'cod.jpg', 'title': 'Запечена тріска зі шпинатом', 'price': '98.00',
             'meal_type': 'dinner', 'description': 'Запечена тріска зі шпинатом і лимонною заправкою.'},
            {'id': 55, 'image': 'chicken-salad.jpg', 'title': 'Салат із куркою та горіхами', 'price': '78.00',
             'meal_type': 'dinner', 'description': 'Салат із куркою, горіхами та овочами.'},
            {'id': 56, 'image': 'ratatouille.jpg', 'title': 'Рататуй', 'price': '65.00', 'meal_type': 'dinner',
             'description': 'Класичний рататуй із додаванням соковитого курячого філе, тушкованого разом із '
                            'баклажанами, кабачками та перцем.'},
            {'id': 57, 'image': 'salmon-avocado-salad.jpg', 'title': 'Салат із лососем та авокадо', 'price': '102.00',
             'meal_type': 'dinner', 'description': 'Салат із лососем, авокадо, шпинатом і кунжутом.'},
            {'id': 58, 'image': 'mushroom-risotto.jpg', 'title': 'Грибне різото', 'price': '80.00',
             'meal_type': 'dinner', 'description': 'Кремове різото з печерицями та пармезаном.'},
            {'id': 59, 'image': 'grilled-vegetable-skewers.jpg', 'title': 'Овочеві шашлички на грилі', 'price': '58.00',
             'meal_type': 'dinner', 'description': 'Шашлички з овочів на грилі з соусом.'},
            {'id': 60, 'image': 'chicken-with-asparagus.jpg', 'title': 'Курка зі спаржею', 'price': '88.00',
             'meal_type': 'dinner', 'description': 'Запечена курка зі спаржею та часниковим соусом.'},
            {'id': 61, 'image': 'cottage-cheese-tomato-salad.jpg', 'title': 'Сирний салат з томатами', 'price': '65.00',
             'meal_type': 'dinner', 'description': 'Легкий салат із кисломолочного сиру та свіжих томатів.'},
            {'id': 62, 'image': 'stewed-cod-veggies.jpg', 'title': 'Тушкована риба з овочами', 'price': '95.00',
             'meal_type': 'dinner', 'description': 'Тріска, тушкована з овочами в томатному соусі.'},
            {'id': 63, 'image': 'baked-eggplants-mozzarella.jpg', 'title': 'Запечені баклажани з моцарелою',
             'price': '85.00', 'meal_type': 'dinner',
             'description': 'Баклажани, запечені з томатами та сиром моцарела.'},
            {'id': 64, 'image': 'chicken-yogurt-broccoli.jpg', 'title': 'Куряче філе в йогурті з броколі',
             'price': '88.00', 'meal_type': 'dinner',
             'description': 'Запечене куряче філе у маринаді з йогурту та часнику.'},
            {'id': 65, 'image': 'squid-cucumber-salad.jpg', 'title': 'Салат з кальмарами та огірком', 'price': '110.00',
             'meal_type': 'dinner', 'description': 'Білкова вечеря: відварені кальмари, яйце та свіжий огірок.'},
            {'id': 66, 'image': 'egg-white-spinach-omelette.jpg', 'title': 'Омлет з білків та шпинату',
             'price': '55.00', 'meal_type': 'dinner',
             'description': 'Ультра-легкий білковий омлет зі свіжим шпинатом.'},
            {'id': 67, 'image': 'turkey-meatballs-tomato.jpg', 'title': 'Тефтелі з індички у томатному соусі',
             'price': '95.00', 'meal_type': 'dinner', 'description': 'Ніжні тефтелі з фаршу індички у власному соку.'},
            {'id': 68, 'image': 'baked-salmon-cabbage.jpg', 'title': 'Запечений лосось із салатом', 'price': '140.00',
             'meal_type': 'dinner', 'description': 'Шматочок лосося з легким капустяним салатом.'},
            {'id': 69, 'image': 'veggie-ragout-tofu.jpg', 'title': 'Овочеве рагу з тофу', 'price': '75.00',
             'meal_type': 'dinner', 'description': 'Веганське рагу з баклажанів, кабачків та сиру тофу.'},
            {'id': 70, 'image': 'grilled-tuna-asparagus.jpg', 'title': 'Стейк з тунця на грилі зі спаржею',
             'price': '160.00', 'meal_type': 'dinner',
             'description': 'Преміум вечеря: стейк зі свіжого тунця та молода спаржа.'},
            {'id': 71, 'image': 'grace-salad.jpg', 'title': 'Салат фітнес', 'price': '80.00', 'meal_type': 'dinner',
             'description': 'Салат із курки, огірка, яйця та йогуртової заправки.'},
            {'id': 72, 'image': 'baked-cauliflower-cheese.jpg', 'title': 'Цвітна капуста запечена з сиром',
             'price': '65.00', 'meal_type': 'dinner',
             'description': 'Цвітна капуста під хрусткою скоринкою з моцарели.'},
            {'id': 73, 'image': 'mussels-tomato-garlic.jpg', 'title': 'Мідії у томатно-часниковому соусі',
             'price': '135.00', 'meal_type': 'dinner', 'description': 'Мідії, тушковані з томатами та часником.'},
            {'id': 74, 'image': 'beef-stewed-mushrooms.jpg', 'title': 'Яловичина тушкована з грибами',
             'price': '115.00', 'meal_type': 'dinner', 'description': 'Яловичина, томлена з печерицями та сметаною.'},
            {'id': 75, 'image': 'flourless-cottage-cheese-pancakes.jpg', 'title': 'Сирники без борошна',
             'price': '70.00', 'meal_type': 'dinner',
             'description': 'Запечені в духовці сирники з сиру та банана (без борошна).'},
        ]

        for dish_data in dishes_data:
            dish, created = Dish.objects.update_or_create(
                id=dish_data['id'],
                defaults={
                    'title': dish_data['title'],
                    'description': dish_data['description'],
                    'price': dish_data['price'],
                    'meal_type': dish_data['meal_type'],
                }
            )

            filename = dish_data['image'].split('/')[-1]
            local_path = os.path.join(settings.BASE_DIR, 'media', 'images', filename)

            if os.path.exists(local_path):
                self.stdout.write(f'Loading: {filename}...')
                with open(local_path, 'rb') as f:
                    dish.image.save(filename, File(f), save=True)
            else:
                self.stdout.write(self.style.WARNING(f'File not found locally: {local_path}'))

        recipes = {
            # --- СНІДАНКИ ---
            1: [('Яйце куряче', 110), ('Молоко 2.5%', 30), ('Болгарський перець', 40), ('Шпинат', 20),
                ('Оливкова олія', 5)],
            2: [('Вівсянка (пластівці)', 50), ('Банан', 80), ('Мигдаль', 15), ('Мед', 10), ('Молоко 2.5%', 100)],
            3: [('Яйце куряче', 110), ('Авокадо', 70), ('Оливкова олія', 5), ('Шпинат', 15)],
            4: [('Грецький йогурт', 140), ('Ягоди (мікс)', 40)],
            5: [('Сир кисломолочний 5%', 140), ('Яйце куряче', 20), ('Борошно', 20), ('Сметана 15%', 20),
                ('Оливкова олія', 5)],
            6: [('Протеїн (порошок)', 30), ('Банан', 100), ('Ягоди (мікс)', 50), ('Молоко 2.5%', 120)],
            7: [('Хліб цільнозерновий', 40), ('Авокадо', 80), ('Яйце куряче', 50), ('Оливкова олія', 5)],
            8: [('Насіння Чіа', 30), ('Молоко мигдальне', 140), ('Ягоди (мікс)', 30)],
            9: [('Яйце куряче', 110), ('Шпинат', 60), ('Оливкова олія', 5)],
            10: [('Банан', 100), ('Яйце куряче', 55), ('Борошно', 30), ('Мед', 15), ('Оливкова олія', 5)],
            11: [('Сир кисломолочний 5%', 150), ('Яйце куряче', 55), ('Борошно', 20), ('Мед', 15)],
            12: [('Хліб цільнозерновий', 40), ('Арахісова паста', 20), ('Банан', 50)],
            13: [('Яйце куряче', 110), ('Томати', 50), ('Сир Фета', 30), ('Оливкова олія', 5)],
            14: [('Вівсянка (пластівці)', 40), ('Яйце куряче', 55), ('Куряче філе', 50), ('Пармезан', 15)],
            15: [('Вівсянка (пластівці)', 50), ('Молоко 2.5%', 100), ('Какао-порошок', 10), ('Мед', 10),
                 ('Волоські горіхи', 15)],
            16: [('Кіноа (суха)', 40), ('Молоко мигдальне', 100), ('Ягоди (мікс)', 50), ('Насіння Чіа', 10)],
            17: [('Яйце куряче', 110), ('Шпинат', 80), ('Хліб цільнозерновий', 30), ('Оливкова олія', 5)],
            18: [('Сир кисломолочний 5%', 150), ('Борошно', 30), ('Яйце куряче', 55), ('Сметана 15%', 20)],
            19: [('Хліб цільнозерновий', 40), ('Тунець (консервований)', 60), ('Огірок', 50), ('Грецький йогурт', 15)],
            20: [('Яйце куряче', 110), ('Броколі', 80), ('Молоко 2.5%', 30), ('Оливкова олія', 5)],
            21: [('Гречка (суха)', 50), ('Молоко 2.5%', 150), ('Мед', 10)],
            22: [('Яблуко', 150), ('Сир кисломолочний 5%', 70), ('Волоські горіхи', 15), ('Мед', 10)],
            23: [('Борошно', 50), ('Яйце куряче', 55), ('Молоко 2.5%', 100), ('Оливкова олія', 5)],
            24: [('Грецький йогурт', 150), ('Волоські горіхи', 20), ('Мед', 15)],
            25: [('Хліб цільнозерновий', 40), ('Моцарела', 40), ('Томати', 50), ('Песто соус', 10)],

            # --- ОБІДИ ---
            26: [('Куряче філе', 120), ('Рис білий (сухий)', 50), ('Броколі', 80), ('Оливкова олія', 5)],
            27: [('Яловичина (пісна)', 130), ('Болгарський перець', 60), ('Цибуля', 40), ('Соєвий соус', 15),
                 ('Оливкова олія', 5), ('Вода питна', 50)],
            28: [('Сочевиця (суха)', 60), ('Морква', 50), ('Цибуля', 40), ('Оливкова олія', 10), ('Вода питна', 300)],
            29: [('Кіноа (суха)', 40), ('Нут (варений)', 80), ('Огірок', 80), ('Оливкова олія', 10), ('Томати', 30)],
            30: [('Лосось (свіжий)', 140), ('Кабачок', 80), ('Морква', 50), ('Оливкова олія', 5)],
            31: [('Індичка (філе)', 140), ('Томати', 80), ('Цибуля', 20), ('Оливкова олія', 5)],
            32: [('Лаваш тонкий', 50), ('Хумус', 50), ('Огірок', 50), ('Томати', 50), ('Шпинат', 20)],
            33: [('Креветки', 120), ('Кабачок', 150), ('Оливкова олія', 10)],
            34: [('Куряче філе', 100), ('Пармезан', 15), ('Хліб цільнозерновий', 30), ('Оливкова олія', 10),
                 ('Томати', 45)],
            35: [('Болгарський перець', 150), ('Яловичина (пісна)', 80), ('Рис білий (сухий)', 30), ('Цибуля', 20),
                 ('Вода питна', 50)],
            36: [('Паста (тверді сорти)', 60), ('Тунець (консервований)', 80), ('Томатна паста', 20), ('Цибуля', 20)],
            37: [('Куряче філе', 100), ('Картопля', 80), ('Буряк', 50), ('Капуста білокачанна', 50), ('Морква', 30)],
            38: [('Куряче філе', 120), ('Рис білий (сухий)', 60), ('Морква', 40), ('Цибуля', 20),
                 ('Оливкова олія', 10)],
            39: [('Гречка (суха)', 60), ('Яловичина (пісна)', 100), ('Печериці', 70), ('Оливкова олія', 5)],
            40: [('Тунець (консервований)', 80), ('Яйце куряче', 55), ('Томати', 60), ('Огірок', 50),
                 ('Оливкова олія', 10)],
            41: [('Картопля', 150), ('Тріска (риба)', 120), ('Сметана 15%', 20), ('Оливкова олія', 5)],
            42: [('Куряче філе', 130), ('Кіноа (суха)', 50), ('Броколі', 60), ('Оливкова олія', 5)],
            43: [('Паста (тверді сорти)', 70), ('Індичка (філе)', 100), ('Томатна паста', 30), ('Цибуля', 20)],
            44: [('Капуста білокачанна', 200), ('Яловичина (пісна)', 120), ('Морква', 40), ('Томатна паста', 20),
                 ('Оливкова олія', 10)],
            45: [('Рис білий (сухий)', 60), ('Креветки', 100), ('Болгарський перець', 50), ('Соєвий соус', 15),
                 ('Оливкова олія', 5)],
            46: [('Гарбуз', 200), ('Морква', 50), ('Цибуля', 30), ('Молоко 2.5%', 50), ('Насіння Чіа', 5)],
            47: [('Яловичина (пісна)', 100), ('Томати', 80), ('Болгарський перець', 50), ('Оливкова олія', 10)],
            48: [('Паста (тверді сорти)', 60), ('Куряче філе', 120), ('Цибуля', 30), ('Оливкова олія', 10)],
            49: [('Сочевиця (суха)', 60), ('Морква', 50), ('Цибуля', 30), ('Молоко 2.5%', 40), ('Оливкова олія', 5)],
            50: [('Куряча печінка', 150), ('Яблуко', 100), ('Цибуля', 40), ('Оливкова олія', 10)],

            # --- ВЕЧЕРІ ---
            51: [('Тофу', 120), ('Броколі', 100), ('Соєвий соус', 20), ('Оливкова олія', 10)],
            52: [('Індичка (філе)', 130), ('Батат', 150), ('Оливкова олія', 5)],
            53: [('Кабачок', 200), ('Песто соус', 20), ('Пармезан', 10)],
            54: [('Тріска (риба)', 180), ('Шпинат', 80), ('Оливкова олія', 5)],
            55: [('Куряче філе', 100), ('Мигдаль', 20), ('Огірок', 80), ('Оливкова олія', 10)],
            56: [('Баклажан', 100), ('Кабачок', 100), ('Томати', 80), ('Куряче філе', 100), ('Оливкова олія', 10)],
            57: [('Лосось (свіжий)', 100), ('Авокадо', 60), ('Шпинат', 40), ('Оливкова олія', 5)],
            58: [('Рис білий (сухий)', 70), ('Печериці', 120), ('Пармезан', 15), ('Цибуля', 20), ('Оливкова олія', 10),
                 ('Вода питна', 150)],
            59: [('Кабачок', 70), ('Печериці', 70), ('Болгарський перець', 60), ('Оливкова олія', 10)],
            60: [('Куряче філе', 140), ('Спаржа', 100), ('Оливкова олія', 5)],
            61: [('Сир кисломолочний 5%', 120), ('Томати', 100), ('Огірок', 50), ('Сметана 15%', 20)],
            62: [('Тріска (риба)', 150), ('Морква', 50), ('Цибуля', 40), ('Томатна паста', 20), ('Оливкова олія', 5)],
            63: [('Баклажан', 150), ('Моцарела', 50), ('Томати', 80), ('Оливкова олія', 5)],
            64: [('Куряче філе', 130), ('Броколі', 100), ('Грецький йогурт', 50), ('Часник', 5)],
            65: [('Кальмар', 120), ('Огірок', 100), ('Яйце куряче', 55), ('Грецький йогурт', 30)],
            66: [('Яєчний білок', 150), ('Шпинат', 80), ('Томати', 50), ('Оливкова олія', 5)],
            67: [('Індичка (філе)', 120), ('Рис білий (сухий)', 20), ('Томатна паста', 30), ('Цибуля', 30)],
            68: [('Лосось (свіжий)', 130), ('Капуста білокачанна', 100), ('Огірок', 50), ('Оливкова олія', 10)],
            69: [('Тофу', 120), ('Кабачок', 100), ('Баклажан', 80), ('Томати', 50), ('Оливкова олія', 10)],
            70: [('Тунець (свіжий)', 130), ('Спаржа', 100), ('Оливкова олія', 10)],
            71: [('Куряче філе', 100), ('Огірок', 80), ('Яйце куряче', 55), ('Грецький йогурт', 30)],
            72: [('Цвітна капуста', 150), ('Моцарела', 40), ('Яйце куряче', 55), ('Сметана 15%', 15)],
            73: [('Мідії', 120), ('Томати', 80), ('Часник', 5), ('Оливкова олія', 10)],
            74: [('Яловичина (пісна)', 130), ('Печериці', 100), ('Цибуля', 40), ('Сметана 15%', 20)],
            75: [('Сир кисломолочний 5%', 150), ('Яйце куряче', 55), ('Банан', 50)],
        }

        DishIngredient.objects.all().delete()

        count_links = 0
        for dish_id, ingredients_list in recipes.items():
            try:
                dish = Dish.objects.get(id=dish_id)
                for ing_name, weight in ingredients_list:
                    ingredient = ing_objects.get(ing_name)
                    if ingredient:
                        DishIngredient.objects.create(
                            dish=dish,
                            ingredient=ingredient,
                            weight_g=weight
                        )
                        count_links += 1
                    else:
                        self.stdout.write(self.style.WARNING(f'Інгредієнт не знайдено: {ing_name}'))
            except Dish.DoesNotExist:
                self.stdout.write(self.style.ERROR(f'Страву ID {dish_id} не знайдено'))

        for dish in Dish.objects.all():
            dish.calculate_nutrition()

            total_weight = sum(item.weight_g for item in dish.dishingredient_set.all())
            dish.portion = f'(~ {int(total_weight)} г порція)'

            dish.save()

        self.stdout.write('Завантаження правил несумісності...')

        incompatibilities_data = [
            ('Молоко 2.5%', 'Огірок', 'Викликає розлад шлунку'),
            ('Молоко 2.5%', 'Тріска (риба)', 'Погано засвоюється разом'),
            ('Молоко 2.5%', 'Лосось (свіжий)', 'Погано засвоюється разом'),
            ('Грецький йогурт', 'Тріска (риба)', 'Несумісність молочного та рибного'),
            ('Молоко 2.5%', 'Тунець (консервований)', 'Небажане поєднання риби та молока'),
            ('Молоко 2.5%', 'Мідії', 'Морепродукти та молоко викликають розлад шлунку'),
            ('Молоко 2.5%', 'Капуста білокачанна', 'Капуста та молоко викликають сильне бродіння'),
            ('Капуста білокачанна', 'Нут (варений)', 'Подвійні бобові/капустяні викликають метеоризм'),
        ]

        IncompatibleIngredient.objects.all().delete()

        count_incompatibilities = 0
        for ing1_name, ing2_name, reason in incompatibilities_data:
            ing1 = ing_objects.get(ing1_name)
            ing2 = ing_objects.get(ing2_name)

            if ing1 and ing2:
                IncompatibleIngredient.objects.get_or_create(
                    ingredient_1=ing1,
                    ingredient_2=ing2,
                    defaults={'reason': reason}
                )
                count_incompatibilities += 1
            else:
                self.stdout.write(self.style.WARNING(f'Не вдалося створити правило для: {ing1_name} - {ing2_name}'))

        self.stdout.write(f'Додано {count_incompatibilities} правил несумісності.')
        self.stdout.write(self.style.SUCCESS('--- БД оновлено ---'))
